RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_lin.h
    bool linTransceiverAutoEnable;     /**< If TRUE, corresponding LIN channel transceiver is enabled automatically,
                                         If FALSE, firmware has to handle the transceiver enable signal manually */

    uint8_t breakFieldLength;           /**< Break field length. */

    cy_en_lin_break_delimiter_length_t breakDelimiterLength; /**< Break delimiter length. See #cy_en_lin_break_delimiter_length_t */

    cy_en_lin_stopbit_t stopBit;        /**< Stop bit length. See #cy_en_lin_stopbit_t. */

    bool filterEnable;                  /**< If TRUE, lin_rx_in filter operates.
                                        Median 3 operates on the last three "lin_rx_in" values.
                                        The sequences '000', '001', '010' and '100' result in a filtered value '0'.
                                        The sequences '111', '110', '101' and '011' result in a filtered value '1'.
                                        */
}cy_stc_lin_config_t;

/**
 *****************************************************************************
 ** \brief LIN Test configuration
 **        This testing functionality simplifies SW development,
 **        but may also be used in the field to verify correct channel functionality.
 *****************************************************************************/
typedef struct cy_stc_lin_test_config
{
    uint8_t chidx;                        /**< Specifies the channel index of the channel to which the test applies.
                                             The test mode allows BOTH of the two connected channels to be tested. */
    bool mode;                            /**< When set FALSE, it is partial disconnect from IOSS. Used to observe messages outside of device.
                                             When Set TRUE, it is full disconnect from IOSS. Used for device test without effecting
                                             operational LIN cluster. */
}cy_stc_lin_test_config_t;

/**
 *****************************************************************************
 ** \brief LIN Error CTL configuration
 **        Used only for software testing.
 **        It enables HW injected channel transmitter errors.
 **        The receiver should detect these errors and report these errors through activation of corresponding interrupt causes.
 *****************************************************************************/
typedef struct cy_stc_lin_test_error_config
{
    uint8_t chidx;                /**< Specifies the channel index of the channel to which the test applies.
                                     The test mode allows BOTH of the two connected channels to be tested. */
    bool txsync_error;            /**< At the receiver, this should result in INTR.RX_HEADER_SYNC_ERROR activation. */
    bool txsyncStop_error;        /**< At the receiver, this should result in INTR.RX_HEADER_SYNC_ERROR or INTR.RX_HEADER_FRAME_ERROR activation. */
    bool txParity_error;        /**< At the receiver, this should result in INTR.RX_HEADER_PARITY_ERROR activation. */
    bool txPIDStop_error;        /**< At the receiver, this should result in INTR.RX_HEADER_FRAME_ERROR activation. */
    bool txDataStop_error;        /**< At the receiver, this should result in INTR.RX_RESPONSE_FRAME_ERROR activation. */
    bool txChecksum_error;        /**< At the receiver, this should result in INTR.RX_RESPONSE_CHECKSUM_ERROR activation. */
    bool txCheksumStop_error;    /**< At the receiver, this should result in INTR.RX_RESPONSE_FRAME_ERROR activation. */
}cy_stc_lin_test_error_config_t;

/** \} group_lin_data_structures */

/*****************************************************************************/
/* Global variable declarations ('extern', definition in C source)           */
/*****************************************************************************/
/** \cond Internal */
/*
* Default values for the CTL Register.
*/

/** Mask for Stop Bits */
#define LIN_CH_CTL0_STOP_BITS_DEFAULT                LIN_ONE_STOP_BIT
/** Mask for Auto Enable */
#define LIN_CH_CTL0_AUTO_EN_DEFAULT                  0U
/** Mask for break delimiter length */
#define LIN_CH_CTL0_BREAK_DELIMITER_LENGTH_DEFAULT   1U
/** Mask for break wake up length */
#define LIN_CH_CTL0_BREAK_WAKEUP_LENGTH_DEFAULT      12U
/** Mask for mode */
#define LIN_CH_CTL0_MODE_DEFAULT                     0U
/** Mask for error ignore */
#define LIN_CH_CTL0_BIT_ERROR_IGNORE_DEFAULT         0U
/** Mask for parity */
#define LIN_CH_CTL0_PARITY_DEFAULT                   0U
/** Mask for parity enable */
#define LIN_CH_CTL0_PARITY_EN_DEFAULT                0U
/** Mask for filter enable */
#define LIN_CH_CTL0_FILTER_EN_DEFAULT                1U
/** Mask for enabled */
#define LIN_CH_CTL0_ENABLED_DEFAULT                  0U
/** Mask for default */
#define LIN_CH_CTL0_DEFAULT (_VAL2FLD(LIN_CH_CTL0_STOP_BITS, LIN_CH_CTL0_STOP_BITS_DEFAULT) | \
                                _VAL2FLD(LIN_CH_CTL0_AUTO_EN, LIN_CH_CTL0_AUTO_EN_DEFAULT) | \
                                _VAL2FLD(LIN_CH_CTL0_BREAK_DELIMITER_LENGTH, LIN_CH_CTL0_BREAK_DELIMITER_LENGTH_DEFAULT) | \
                                _VAL2FLD(LIN_CH_CTL0_BREAK_WAKEUP_LENGTH, LIN_CH_CTL0_BREAK_WAKEUP_LENGTH_DEFAULT) | \
                                _VAL2FLD(LIN_CH_CTL0_MODE, LIN_CH_CTL0_MODE_DEFAULT) | \
                                _VAL2FLD(LIN_CH_CTL0_BIT_ERROR_IGNORE, LIN_CH_CTL0_BIT_ERROR_IGNORE_DEFAULT) | \
                                _VAL2FLD(LIN_CH_CTL0_PARITY, LIN_CH_CTL0_PARITY_DEFAULT) | \
                                _VAL2FLD(LIN_CH_CTL0_PARITY_EN, LIN_CH_CTL0_PARITY_EN_DEFAULT) | \
                                _VAL2FLD(LIN_CH_CTL0_FILTER_EN, LIN_CH_CTL0_FILTER_EN_DEFAULT) | \
                                _VAL2FLD(LIN_CH_CTL0_ENABLED, LIN_CH_CTL0_ENABLED_DEFAULT))

/* Macros for the conditions used by CY_ASSERT calls */
#define CY_LIN_TEST_CTL_CH_IDX_MIN          0U        /** LIN Test Ctl Channel index Minimum value */
#define CY_LIN_TEST_CTL_CH_IDX_MAX          31U       /** LIN Test Ctl Channel index Maximum value */

#define CY_LIN_IS_TEST_CTL_CH_IDX_VALID(chidx)       ((chidx) <= CY_LIN_TEST_CTL_CH_IDX_MAX)


/** \endcond */

/**
* \addtogroup group_lin_functions
* \{
*/

/*****************************************************************************/
/* Global function prototypes ('extern', definition in C source)             */
/*****************************************************************************/
/**
 *****************************************************************************
 ** \brief Deinitialization of a LIN module.
 ** This function deinitializes the selected LIN channel.
 **
 ** \param [in]  base       Pointer to LIN instance channel register
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_DeInit
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_DeInit( LIN_CH_Type* base );

/**
 *****************************************************************************
 ** \brief Initializes the LIN module.
 ** This function initializes LIN according to the options setup in the
 ** passed Config Struct. Several checkings are done before that and an error
 ** is returned if invalid Modes are requested.
 **
 ** \pre The Application must configure corresponding LIN pins (SIN, SOT)
 **      according to requirements and settings of LIN instance.
 **      And must set baud rate using SysClk. LIN I/F has internal fixed
 **      oversampling value (16). Therefore, LIN clock / 16 is actual
 **      baud rate.
 **
 ** \param [in]  base        Pointer to LIN instance register area
 ** \param [in]  pstcConfig     LIN module configuration. See #cy_stc_lin_config_t.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_Init
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_Init( LIN_CH_Type* base, const cy_stc_lin_config_t *pstcConfig);

/**
 *****************************************************************************
 ** \brief Reads response data.
 **        Data is read in Bytes. Maximum data length is 8-bytes.
 **
 ** \pre Must be run after RX_RESPONSE_DONE.
 **
 ** \note This function returns last received data set.
 **
 ** \param  base     [in]        Pointer to LIN instance register area.
 ** \param  data     [out]       Pointer to received data.
 **                              Must have enough space for current Rx data.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_ISR
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_ReadData( LIN_CH_Type* base, uint8_t *data);

/**
 *****************************************************************************
 ** \brief Writes response data.
 **        Data is written in Bytes. Maximum data length is 8-bytes.
 ** \param  base         [in]        Pointer to LIN instance register area.
 ** \param  data         [in]        Pointer to response data.
 ** \param  dataLength   [in]        Data length in bytes.
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_Sequence
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_WriteData( LIN_CH_Type* base, const uint8_t *data, uint8_t dataLength );

/**
 *****************************************************************************
 ** \brief Enables LIN channel.
 **
 ** \param  base  [in]  Pointer to LIN instance register area.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_Enable
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_Enable(LIN_CH_Type* base);

/**
 *****************************************************************************
 ** \brief Disables LIN channel.
 **        Disabling LIN channel causes clearing of non retained registers.
 **        e.g) CMD register, INTR register, STATUS register.
 **        This behavior can be used for re-initialization, after error or
 **        abort RX operation.
 **
 ** \param  base  [in]  Pointer to LIN instance register area.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_Disable
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_Disable(LIN_CH_Type* base);

/**
 *****************************************************************************
 ** \brief Sets LIN break/wakeup field length.
 **        Normally this I/F is used for detection of the wakeup pulse.
 **
 ** \param  base  [in]  Pointer to LIN instance register area.
 ** \param  length   [in]  Bit length of the break/wakeup field.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_SetBreakWakeupFieldLength(LIN_CH_Type* base, uint8_t length);

/**
 *****************************************************************************
 ** \brief Sets LIN response field data length.
 **        Data is in Bytes and maximum data length is 8-bytes.
 **
 ** \param  base     [in]  Pointer to LIN instance register area.
 ** \param  length   [in]  Data length in byte
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_SetDataLength
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_SetDataLength(LIN_CH_Type* base, uint8_t length);

/**
 *****************************************************************************
 ** \brief Sets LIN checksum type setting.
 **
 ** \param  base     [in]  Pointer to LIN instance register area.
 ** \param  type     [in]  Checksum type. Refer \ref cy_en_lin_checksum_type_t
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_SetChecksumType
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_SetChecksumType(LIN_CH_Type* base, cy_en_lin_checksum_type_t type);

/**
 *****************************************************************************
 ** \brief Sets LIN operation command.
 **
 ** \note As a normal usage, following combinations are used.
 **       - Master
 **         Header TX only          : LIN_CMD_TX_HEADER
 **         Header TX & TX response : LIN_CMD_TX_HEADER_TX_RESPONSE
 **         Header TX & RX response : LIN_CMD_TX_HEADER_RX_RESPONSE
 **       - Slave
 **         Header RX               : LIN_CMD_RX_HEADER_RX_RESPONSE
 **         TX response             : LIN_CMD_TX_RESPONSE
 **         RX response             : Already set when header RX
 **         As a typical usage, RX response is always set at header RX phase.
 **       - Wakeup frame            : LIN_CMD_TX_WAKEUP
 **       Instead of above macro, you can use raw definition LIN_CH_CMD_*_Msk defined in IO header file.
 **
 ** \param  base     [in]  Pointer to LIN instance register area.
 ** \param  command  [in]  Required operation command. Refer \ref group_lin_cmd_macro
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_SetCmd
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_SetCmd(LIN_CH_Type* base, uint32_t command);

/**
 *****************************************************************************
 ** \brief Sets LIN header for master tx header operation.
 **
 ** \param  base    [in]  Pointer to LIN instance register area.
 ** \param  id      [in]  ID value
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_SetHeader
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_SetHeader(LIN_CH_Type* base, uint8_t id);

/**
 *****************************************************************************
 ** \brief Returns received LIN header.
 **
 ** \param  base    [in]  Pointer to LIN instance register area.
 ** \param  id      [out] Received ID value.
 ** \param  parity  [out] Received parity value.
 **                       Note that parity check is always done by HW automatically.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_GetHeader(LIN_CH_Type* base, uint8_t *id, uint8_t *parity);

/**
 *****************************************************************************
 ** \brief Sets interrupt source to be accepted.
 **
 ** \param  base    [in]  Pointer to LIN instance register area.
 ** \param  mask    [in]  The mask with the OR of the interrupt source to be accepted.
 **                       See \ref group_lin_intr_mask_macro for the set of constants.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_Sequence
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_SetInterruptMask(LIN_CH_Type* base, uint32_t mask);

/**
 *****************************************************************************
 ** \brief Returns interrupt mask setting.
 **
 ** \param  base [in]  Pointer to LIN instance register area.
 ** \param  mask  [out] The mask with the OR of the interrupt source which is masked.
 **                       See \ref group_lin_intr_mask_macro for the set of constants.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_Sequence
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_GetInterruptMask(LIN_CH_Type* base, uint32_t *mask);

/**
 *****************************************************************************
 ** \brief Returns interrupt masked status.
 **
 ** \param  base    [in]  Pointer to LIN instance register area.
 ** \param  status  [out] The mask with the OR of the interrupt source which occurs.
 **                       See \ref group_lin_intr_mask_macro for the set of constants.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_ISR
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_GetInterruptMaskedStatus(LIN_CH_Type* base, uint32_t *status);

/**
 *****************************************************************************
 ** \brief Returns interrupt raw status.
 **
 ** \param  base    [in]  Pointer to LIN instance register area.
 ** \param  status  [out] The mask with the OR of the interrupt source which occurs.
 **                       See \ref group_lin_intr_mask_macro for the set of constants.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_ISR
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_GetInterruptStatus(LIN_CH_Type* base, uint32_t *status);

/**
 *****************************************************************************
 ** \brief Clears interrupt status.
 **
 ** \param  base [in]  Pointer to LIN instance register area.
 ** \param  mask    [in]  The mask with the OR of the interrupt source to be cleared.
 **                       See \ref group_lin_intr_mask_macro for the set of constants.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_ISR
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_ClearInterrupt(LIN_CH_Type* base, uint32_t mask);

/**
 *****************************************************************************
 ** \brief Returns LIN module status.
 **
 ** \param  base [in]  Pointer to LIN instance register area.
 ** \param  status  [out] LIN module status.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_ISR
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_GetStatus(LIN_CH_Type* base, uint32_t *status);

/**
 *****************************************************************************
 ** \brief  Enables LIN channel 'en' out.
 **
 ** If linTransceiverAutoEnable in cy_stc_lin_config_t config structure is set to true
 ** then transceiver is set automatically and user need not call this function,
 ** else user has to call Cy_Status_EnOut_Enable() before sending a message and call
 ** Cy_Status_EnOut_Disable() after sending the message.
 **
 ** \param  base [in]  Pointer to LIN instance register area.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_Init_Example
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_EnOut_Enable(LIN_CH_Type* base);

/**
 *****************************************************************************
 ** \brief  Disables LIN channel 'en' out.
 **
 ** If linTransceiverAutoEnable in cy_stc_lin_config_t config structure is set to true
 ** then transceiver is set automatically and user need not call this function,
 ** else user has to call Cy_Status_EnOut_Enable() before sending a message and call
 ** Cy_Status_EnOut_Disable() after sending the message.
 **
 ** \param  base [in]  Pointer to LIN instance register area.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_EnOut_Disable(LIN_CH_Type* base);

/**
 *****************************************************************************
 ** \brief  Enables LIN Testing mode.
 **
 ** This testing functionality simplifies SW development,
 ** but may also be used in the field to verify correct channel functionality.
 **
 ** \param  base [in]  Pointer to LIN instance register area.
 ** \param  lin_test_config [in] pointer to Test configuration structure.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 ** \funcusage
 ** \snippet lin/snippet/main.c snippet_Cy_LIN_Init_Example
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_TestMode_Enable(LIN_Type* base, const cy_stc_lin_test_config_t* lin_test_config);

/**
 *****************************************************************************
 ** \brief  Disables LIN Testing mode.
 **
 ** This testing functionality simplifies SW development,
 ** but may also be used in the field to verify correct channel functionality.
 **
 ** \param  base [in]  Pointer to LIN instance register area.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_TestMode_Disable(LIN_Type* base);

/**
 *****************************************************************************
 ** \brief  Enables LIN ERROR CTL.
 **
 ** Enables HW injected channel transmitter errors.
 ** The receiver should detect these errors and report these errors through activation of corresponding interrupt causes.
 **
 ** \param  base [in]  Pointer to LIN instance register area.
 ** \param  test_error_config [in] pointer to Test Error configuration structure.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_ErrCtl_Enable(LIN_Type* base, cy_stc_lin_test_error_config_t* test_error_config);

/**
 *****************************************************************************
 ** \brief  Disables LIN ERROR CTL.
 **
 ** Disables HW injected channel transmitter errors.
 **
 ** \param  base [in]  Pointer to LIN instance register area.
 **
 ** \retval Refer \ref cy_en_lin_status_t
 **
 *****************************************************************************/
cy_en_lin_status_t Cy_LIN_ErrCtl_Disable(LIN_Type* base);


/** \} group_lin_functions */
/** @} */

#ifdef __cplusplus
}
#endif
#endif /*(CY_IP_MXLIN) */
#endif /* __CY_LIN_H__ */

/** \} group_lin */

/*****************************************************************************/
/* EOF (not truncated)                                                       */
/*****************************************************************************/
